# üêº Pandas Handbook

## 08 - Data Analyzing - Filtering, Sorting, Grouping, Aggregating & Pivoting

Check out the official [Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/)  

This notebook uses the [Titanic - Machine Learning from Disaster dataset](https://www.kaggle.com/competitions/titanic/data) from Kaggle to demonstrate how to analyze data with pandas.

## üìö Table of Contents

---

üîç **Filtering Data**  
üîΩ **Sorting Data**  
üßÆ **Aggregating Data**  
üë• **Grouping Data**  
üìä **Pivoting Data**  
üëâ **Next Topic: Dates and Time Series**  

---

In [1]:
import pandas as pd
import os

In [2]:
data_processed = "../data/processed/"
csv_file = "clean_titanic.csv"
import_path = os.path.join(data_processed, csv_file)
df = pd.read_csv(import_path, index_col="PassengerId")
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Unknown,Southampton
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,Cherbourg
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Unknown,Southampton
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,Southampton
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Unknown,Southampton

### üîç Filtering data

```df['COLUMN'] == VALUE``` ‚Äì Creates a filter for rows where the column equals a specific value.  
```df.loc[FILTER, ['COLUMN_1', 'COLUMN_2']]``` ‚Äì Filters rows based on a filter and selects specific columns.

In [3]:
third_class_survivers_filter = ((df['Survived'] == 1) & (df['Pclass'] == 3))
third_class_survivers_df = df.loc[third_class_survivers_filter, ['Name', 'Sex', 'Age', 'Fare']]
third_class_survivers_df.head()

,Name,Sex,Age,Fare
PassengerId,,,,
3,"Heikkinen, Miss. Laina",female,26.0,7.9250
9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,11.1333
11,"Sandstrom, Miss. Marguerite Rut",female,4.0,16.7000
20,"Masselmani, Mrs. Fatima",female,28.0,7.2250
23,"McGowan, Miss. Anna ""Annie""",female,15.0,8.0292

In [4]:
len(third_class_survivers_df)

119

### üîΩ Sorting data

```df['COLUMN'].sort_values()``` ‚Äì Returns a Series sorted by values in ascending order.  
```df.sort_values(by=['COLUMN_1', 'COLUMN_2'], ascending=[True, False])``` ‚Äì Sorts the DataFrame by multiple columns with specified sort orders.  
```df['COLUMN'].nlargest(N)``` ‚Äì Returns the N largest values in a column.  
```df.nlargest(N, 'COLUMN')``` ‚Äì Returns the N rows with the largest values in a column.  
```df.nsmallest(N, 'COLUMN')``` ‚Äì Returns the N rows with the smallest values in a column.

In [5]:
third_class_survivers_df['Age'].sort_values()

PassengerId
804     0.42
470     0.75
645     0.75
173     1.00
382     1.00
       ...
26     38.00
401    39.00
415    44.00
339    45.00
484    63.00
Name: Age, Length: 119, dtype: float64

In [6]:
third_class_survivers_df = third_class_survivers_df.sort_values(by=['Age', 'Fare'], ascending=[True, False])
third_class_survivers_df.head()

                                        Name     Sex   Age     Fare
PassengerId
804          Thomas, Master. Assad Alexander    male  0.42   8.5167
470            Baclini, Miss. Helene Barbara  female  0.75  19.2583
645                   Baclini, Miss. Eugenie  female  0.75  19.2583
789               Dean, Master. Bertram Vere    male  1.00  20.5750
382              Nakid, Miss. Maria ("Mary")  female  1.00  15.7417

In [7]:
third_class_survivers_df['Age'].nlargest(5)

PassengerId
484    63.0
339    45.0
415    44.0
401    39.0
26     38.0
Name: Age, dtype: float64

In [8]:
third_class_survivers_df.nlargest(5, 'Fare')

                        Name   Sex   Age     Fare
PassengerId
510           Lang, Mr. Fang  male  26.0  56.4958
644          Foo, Mr. Choong  male  28.0  56.4958
693             Lam, Mr. Ali  male  28.0  56.4958
75             Bing, Mr. Lee  male  32.0  56.4958
839          Chip, Mr. Chang  male  32.0  56.4958

In [9]:
third_class_survivers_df.nsmallest(5, 'Fare')

                                          Name     Sex   Age    Fare
PassengerId
272               Tornquist, Mr. William Henry    male  25.0  0.0000
805                    Hedman, Mr. Oskar Arvid    male  27.0  6.9750
128                  Madsen, Mr. Fridtjof Arne    male  24.0  7.1417
876           Najib, Miss. Adele Kiamie "Jane"  female  15.0  7.2250
554          Leeni, Mr. Fahim ("Philip Zenni")    male  22.0  7.2250

### üßÆ Aggregating  data

```df['COLUMN'].mean()``` ‚Äì Calculates the mean of a column.  
```df['COLUMN'].median()``` ‚Äì Calculates the median of a column.  
```df['COLUMN'].mode()``` ‚Äì Returns the mode(s) of a column.  
```df[['COLUMN_1', 'COLUMN_2']].corr()``` ‚Äì Computes the pairwise correlation between columns.  
```df[['COLUMN_1', 'COLUMN_2']].cov()``` ‚Äì Computes the pairwise covariance between columns.

In [10]:
third_class_survivers_df['Age'].mean()

np.float64(22.747226890756302)

In [11]:
third_class_survivers_df['Age'].median()

np.float64(27.0)

In [12]:
third_class_survivers_df['Age'].mode()

0    28.0
Name: Age, dtype: float64

In [13]:
correlation_matrix = df[['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].corr()
correlation_matrix

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.064910 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.339898  0.083081  0.018443 -0.549500
Age      -0.064910 -0.339898  1.000000 -0.233296 -0.172482  0.096688
SibSp    -0.035322  0.083081 -0.233296  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.172482  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096688  0.159651  0.216225  1.000000

In [14]:
covariance_matrix =df[['Survived', 'Age', 'Fare']].cov()
covariance_matrix

          Survived         Age         Fare
Survived  0.236772   -0.411226     6.221787
Age      -0.411226  169.512498    62.556767
Fare      6.221787   62.556767  2469.436846

### üë• Grouping data

```df.groupby(['COLUMN'])['COLUMN_2'].mean()``` ‚Äì Groups the DataFrame by one column and calculates the mean of another.  
```df.groupby(['COLUMN_1', 'COLUMN_2'])``` ‚Äì Creates a multi-level groupby object.  
```group['COLUMN'].value_counts()``` ‚Äì Counts unique values in each group.  
```group['COLUMN'].value_counts().loc[KEY]``` ‚Äì Returns value counts for a specific group key.  
```group['COLUMN'].value_counts(normalize=True)``` ‚Äì Calculates the relative frequencies of values in each group.  
```group['COLUMN'].median()``` ‚Äì Computes the median for each group.  
```group['COLUMN'].median().loc[KEY]``` ‚Äì Retrieves the median for a specific group key.  
```group['COLUMN'].agg(['median', 'mean', 'std', 'min', 'max'])``` ‚Äì Aggregates multiple statistics per group.  
```group['COLUMN'].agg(['median', 'mean']).loc[KEY]``` ‚Äì Aggregates selected stats and selects a specific group.  
```group['COLUMN'].apply(lambda x: x.str.contains('PATTERN').sum())``` ‚Äì Counts how many entries in each group match a string pattern.  
```df['COLUMN'].value_counts()``` ‚Äì Counts unique values in a column.  
```df['COLUMN'].count()``` ‚Äì Counts non-null values in a column.  
```group['COLUMN'].apply(lambda x: x.str.contains('PATTERN').sum()).loc[KEY]``` ‚Äì Retrieves counts for a pattern-matching condition from a specific group.  
```group['COLUMN'].count()``` ‚Äì Counts non-null entries in a column for each group.  
```df.groupby('COLUMN').agg({'COLUMN_1': ['mean', 'median'], 'COLUMN_2': ['mean', 'max', 'min']})``` ‚Äì Applies multiple aggregation functions on multiple columns grouped by a specified column.

In [15]:
new_group = df.groupby(['Survived'])['Age'].mean()
new_group

Survived
0    30.028233
1    28.291433
Name: Age, dtype: float64

In [16]:
new_group = df.groupby(['Survived', 'Pclass'])
new_group.get_group((1,1))

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,Cherbourg
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,Southampton
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,Southampton
24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,Southampton
32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,28.0,1,0,PC 17569,146.5208,B78,Cherbourg
...,...,...,...,...,...,...,...,...,...,...,...
863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,Southampton
872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,Southampton
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,Cherbourg
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,Southampton
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,Cherbourg

In [17]:
new_group['Sex'].value_counts()

Survived  Pclass  Sex
0         1       male       77
                  female      3
          2       male       91
                  female      6
          3       male      300
                  female     72
1         1       female     91
                  male       45
          2       female     70
                  male       17
          3       female     72
                  male       47
Name: count, dtype: int64

In [18]:
new_group['Sex'].value_counts().loc[1]

Pclass  Sex
1       female    91
        male      45
2       female    70
        male      17
3       female    72
        male      47
Name: count, dtype: int64

In [19]:
new_group['Sex'].value_counts(normalize=True)

Survived  Pclass  Sex
0         1       male      0.962500
                  female    0.037500
          2       male      0.938144
                  female    0.061856
          3       male      0.806452
                  female    0.193548
1         1       female    0.669118
                  male      0.330882
          2       female    0.804598
                  male      0.195402
          3       female    0.605042
                  male      0.394958
Name: proportion, dtype: float64

In [20]:
new_group['Age'].median()

Survived  Pclass
0         1         38.5
          2         30.0
          3         28.0
1         1         33.5
          2         28.0
          3         27.0
Name: Age, dtype: float64

In [21]:
new_group['Age'].median().loc[0]

Pclass
1    38.5
2    30.0
3    28.0
Name: Age, dtype: float64

In [22]:
new_group['Age'].agg(['median', 'mean', 'std', 'min', 'max'])

                 median       mean        std    min   max
Survived Pclass
0        1         38.5  40.556250  15.040240   2.00  71.0
         2         30.0  33.144330  11.788713  16.00  70.0
         3         28.0  26.951613  10.523063   1.00  74.0
1        1         33.5  34.609706  13.219438   0.92  80.0
         2         28.0  25.998046  14.495355   0.67  62.0
         3         27.0  22.747227  10.656174   0.42  63.0

In [23]:
new_group['Age'].agg(['median', 'mean']).loc[0]

        median       mean
Pclass
1         38.5  40.556250
2         30.0  33.144330
3         28.0  26.951613

In [24]:
new_group['Name'].apply(lambda x: x.str.contains('Mrs.').sum())

Survived  Pclass
0         1          1
          2          5
          3         21
1         1         43
          2         38
          3         21
Name: Name, dtype: int64

In [25]:
new_group['Name'].apply(lambda x: x.str.contains('Mrs.').sum()).loc[0]

Pclass
1     1
2     5
3    21
Name: Name, dtype: int64

In [26]:
df['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [27]:
df['Survived'].count()

np.int64(891)

In [28]:
new_group['Name'].apply(lambda x: x.str.contains('Mrs.').sum())

Survived  Pclass
0         1          1
          2          5
          3         21
1         1         43
          2         38
          3         21
Name: Name, dtype: int64

In [29]:
total_passengers = new_group['Name'].count()
mrs_count = new_group['Name'].apply(lambda x: x.str.contains('Mrs.').sum())
new_df = pd.concat([total_passengers, mrs_count], axis=1)
new_df.columns = ['Total', 'Mrs_Count']
new_df

                 Total  Mrs_Count
Survived Pclass
0        1          80          1
         2          97          5
         3         372         21
1        1         136         43
         2          87         38
         3         119         21

In [30]:
agg_df = df.groupby('Pclass').agg({
    'Age': ['mean', 'median'],
    'Fare': ['mean', 'max', 'min']
})
agg_df

              Age              Fare
             mean median       mean       max  min
Pclass
1       36.812130   35.0  84.154687  512.3292  0.0
2       29.765380   28.0  20.662183   73.5000  0.0
3       25.932627   28.0  13.675550   69.5500  0.0

### üìä Pivoting data

```df.pivot(index='COLUMN', columns='COLUMN_2', values=['COLUMN_3'])``` ‚Äì Reshapes the DataFrame based on column values as new columns.  
```pd.pivot_table(df, index='COLUMN_1', columns='COLUMN_2', values='COLUMN_3', aggfunc='mean')``` ‚Äì Creates a pivot table using the mean as the aggregation function.  
```pd.pivot_table(df, index='COLUMN_1', columns='COLUMN_2', values=['COLUMN_3', 'COLUMN_4'], aggfunc=['mean', 'median'])``` ‚Äì Creates a pivot table with multiple values and aggregation functions.

In [31]:
pivoted_df = df.pivot(index='Name', columns='Sex', values=['Age'])
pivoted_df.head()

                                         Age
Sex                                   female  male
Name
Abbing, Mr. Anthony                      NaN  42.0
Abbott, Mr. Rossmore Edward              NaN  16.0
Abbott, Mrs. Stanton (Rosa Hunt)        35.0   NaN
Abelson, Mr. Samuel                      NaN  30.0
Abelson, Mrs. Samuel (Hannah Wizosky)   28.0   NaN

In [32]:
pivot = pd.pivot_table(df, index='Sex', columns='Pclass', values='Fare', aggfunc='mean')
pivot

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [33]:
pivot = pd.pivot_table(df, index='Sex', columns='Pclass', values=['Survived', 'Age'], aggfunc=['mean', 'median'])
pivot

             mean                                                     median  \
              Age                        Survived                        Age
Pclass          1          2          3         1         2         3      1
Sex
female  33.978723  28.703947  23.572917  0.968085  0.921053  0.500000   32.5
male    38.995246  30.512315  26.911873  0.368852  0.157407  0.135447   36.0


                   Survived
Pclass     2     3        1    2    3
Sex
female  28.0  28.0      1.0  1.0  0.5
male    29.0  28.0      0.0  0.0  0.0

### üëâ Next Topic: [Dates and Time Series](./09-dates-timeseries.ipynb)

Learn how to work with Dates and Time Series in pandas.